In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [9]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [10]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [11]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [12]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [13]:
import pandas_datareader.data as web

In [14]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [15]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})

volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [16]:
returns = price.pct_change()

In [17]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-10-16 -0.014001  0.008327  0.000000  0.008902
2020-10-19 -0.025542 -0.003256 -0.024766 -0.024412
2020-10-20  0.013192 -0.064930  0.002007  0.013893
2020-10-21 -0.005446 -0.019681  0.000699  0.024024
2020-10-22 -0.009583  0.006084  0.000419  0.013820

In [18]:
returns['MSFT'].corr(returns['IBM'])

0.5721761351844468

In [19]:
returns['MSFT'].cov(returns['IBM'])

0.00016025616734807992

In [20]:
returns.MSFT.corr(returns.IBM)

0.5721761351844468

In [21]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.490475  0.716301  0.661294
IBM   0.490475  1.000000  0.572176  0.525417
MSFT  0.716301  0.572176  1.000000  0.780360
GOOG  0.661294  0.525417  0.780360  1.000000

In [22]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000355  0.000149  0.000234  0.000205
IBM   0.000149  0.000261  0.000160  0.000139
MSFT  0.000234  0.000160  0.000301  0.000223
GOOG  0.000205  0.000139  0.000223  0.000270

In [23]:
returns.corrwith(returns.IBM)

AAPL    0.490475
IBM     1.000000
MSFT    0.572176
GOOG    0.525417
dtype: float64

In [24]:
returns.corrwith(volume)

AAPL   -0.098188
IBM    -0.085129
MSFT   -0.095723
GOOG   -0.178977
dtype: float64

In [25]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [26]:
uniques = obj.unique()

In [27]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [28]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [29]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
b    2
a    3
dtype: int64

In [30]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [31]:
mask = obj.isin(['b', 'c'])

In [32]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [33]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [34]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [35]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [36]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [37]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [38]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [40]:
result = data.apply(pd.value_counts).fillna(0)

In [41]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0